#+TITLE: Monte Carlo Simulation
#+DATE: \today
#+HUGO_BASE_DIR: /home/eherbst/Dropbox/www/
#+HUGO_SECTION: teaching/bank-of-colombia-smc/lectures
#+hugo_custom_front_matter: :math true
#+hugo_auto_set_lastmod: t
#+MACRO: NEWLINE @@latex:\\~\\~@@ @@html:<br>@@ @@ascii:|@@
#+OPTIONS: toc:nil H:2
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{helvet}
#+LaTEX_HEADER: \usepackage{natbib}
#+LATEX_HEADER: \bibliographystyle{ecta}
#+LaTEX_HEADER: \beamertemplatenavigationsymbolsempty
#+LaTeX_HEADER: \usepackage{bibentry}
#+LaTeX_HEADER: \nobibliography*
#+LaTeX_HEADER: \makeatletter\renewcommand\bibentry[1]{\nocite{#1}{\frenchspacing\@nameuse{BR@r@#1\@extra@b@citeb}}}\makeatother
#+LaTeX_CLASS: beamer

** Importance Sampling in a DSGE Model                             :noexport:
   

   #+begin_src jupyter-python :session is :eval no-export
     from scipy.optimize import minimize
     from dsge.DSGE import DSGE

     dsge1 = DSGE.read('/home/eherbst/Dropbox/archive/DSGE Book (1)/dsge-book/code/models/dsge1/dsge1.yaml')
     dsge1['__data__']['estimation']['data'] = '/home/eherbst/Dropbox/archive/DSGE Book (1)/dsge-book/code/models/dsge1/us.txt'
     dsge1_lin = dsge1.compile_model()


     p0 = [2.83, 0.78, 1.80, 0.63, 0.77, 0.98, 0.88, 0.42, 3.30, 0.52, 0.22, 0.71, 0.31]
     objfun = lambda x: -dsge1_lin.log_post(x)

     results = minimize(objfun, p0, method='Nelder-Mead')
     results = minimize(objfun, p0)
   #+end_src

   #+RESULTS:
   : /home/eherbst/anaconda3/lib/python3.6/site-packages/dsge/gensys.py:59: UserWarning: 5 unstable roots, but only 4  RE errors! No solution.
   :   f"{nunstab} unstable roots, but only {len(bigev)} "

#+begin_src jupyter-python :session is :eval no-export
  from scipy.stats import multivariate_normal
  N = 1000
  is_distribution = multivariate_normal(mean=results.x, cov=0.2*results.hess_inv,allow_singular=True) 
  is_sample = is_distribution.rvs(size=N)

  weights = np.array([dsge1_lin.log_post(para)/is_distribution.pdf(para) for para in is_sample])
  weights = weights / weights.sum()
  1 / (weights**2).sum()

  (is_sample * weights[:,np.newaxis]).sum(0)
#+end_src

#+RESULTS:
: array([2.64802392, 1.00087381, 1.95690643, 0.41061811, 0.77402402,
:        1.00085795, 0.88569908, 0.20333216, 3.34714949, 0.63309187,
:        0.21045311, 0.68451808, 0.28409454])


